{"config": {"name": "sequential", "layers": [{"config": {"batch_input_shape": [null, 17, 2], "name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 128, "activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 2, "activation": "softmax", "bias_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf"}